FROM node:12.16.2

# Создаем директорию, содержащую проект
RUN mkdir /app
# Устанавлием ее как рабочую директорию для последующих команд
WORKDIR /app

# Копируем package.json и package-lock.json и устанавлием пакеты
COPY package*.json ./
RUN npm install
# Сначала копируем только файлы, требуемые для установки модулей, чтобы кешировать слой с установкой зависимостей, ведь он меняется реже, чем основной код

# Копируем все файлы и делаем билд
COPY . /app
RUN npm run-script build


EXPOSE 3000

CMD ["node", "server"]
